Revit 2026 API

# DWFImportOptions Methods

---

The DWFImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetSheetViews | Get sheet views where DWF markups are imported. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetSheetViews |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DWFImportOptions Class

Autodesk.Revit.DB Namespace